list_of_dicts = [
    {
        'Барнаул': 7,
        'Владивосток': 9,
        'Волгоград': 9,
        'Ижевск': 5,
        'Махачкала': 7,
        'Москва': 9,
        'Омск': 9,
        'Саратов': 4,
        'Ульяновск': 3
    },
    {
        'Казань': 8,
        'Краснодар': 2,
        'Москва': 3,
        'Самара': 3,
        'Санкт-Петербург': 6,
        'Тюмень': 1,
        'Уфа': 7
    },
    {
        'Ижевск': 1,
        'Иркутск': 3,
        'Кемерово': 1,
        'Москва': 3,
        'Саратов': 3,
        'Хабаровск': 6
    },
    {
        'Барнаул': 7,
        'Оренбург': 3,
        'Санкт-Петербург': 1,
        'Тюмень': 4,
        'Ярославль': 3
    }
]

new_dct = {}

for i in list_of_dicts:
    for k, v in i.items():
        if k in new_dct:
            new_dct[k].append(v)
        else:
            new_dct[k] = [v]
            
for key, value in new_dct.items():
    print(f'{key}: {value}')
    
# Барнаул: [7, 7]
# Владивосток: [9]
# Волгоград: [9]
# Ижевск: [5, 1]
# Махачкала: [7]
# Москва: [9, 3, 3]
# Омск: [9]
# Саратов: [4, 3]
# Ульяновск: [3]
# Казань: [8]
# Краснодар: [2]
# Самара: [3]
# Санкт-Петербург: [6, 1]
# Тюмень: [1, 4]
# Уфа: [7]
# Иркутск: [3]
# Кемерово: [1]
# Хабаровск: [6]
# Оренбург: [3]
# Ярославль: [3]